In [2]:
import numpy as np
import pandas as pd

###CREATING DATA FRAMES

In [3]:
#using dictionary
data_frame1 ={
    'Name' : ["Raj","Ashok","Vijay","Rahul"],
    'Age'  : [19,20,21,18],
    'Class': [12,11,12,10],
    'State': ["Rajasthan","Gujrat","Rajasthan","Tamil nadu"]
}
DF1 =pd.DataFrame(data_frame1)
DF1

    Name  Age  Class       State
0    Raj   19     12   Rajasthan
1  Ashok   20     11      Gujrat
2  Vijay   21     12   Rajasthan
3  Rahul   18     10  Tamil nadu

In [4]:
#using list
data_frame2 = [
    ["Raj",18,12,"Rajasthan"],
    ["Ashok",17,11,"Gujrat"],
    ["Vijay",19,12,"Rajasthan"],
    ["Rahul",18,11,"Tamil nadu"]
               ]
labels = ["Name","Age","Class","State"]
DF2 = pd.DataFrame(data_frame2,columns=labels)
DF2

    Name  Age  Class       State
0    Raj   18     12   Rajasthan
1  Ashok   17     11      Gujrat
2  Vijay   19     12   Rajasthan
3  Rahul   18     11  Tamil nadu

### SELECTION AND INDEXING OF COLUMNS

In [5]:
DF1['name']

KeyError: 'name'

In [ ]:
DF2[['Name','Age']]

    Name  Age
0    Raj   18
1  Ashok   17
2  Vijay   19
3  Rahul   18

###CREATING NEW COLUMN

In [ ]:
DF2['Percentage'] = [88,89,98,78]
DF2

    Name  Age  Class       State  Percentage
0    Raj   18     12   Rajasthan          88
1  Ashok   17     11      Gujrat          89
2  Vijay   19     12   Rajasthan          98
3  Rahul   18     11  Tamil nadu          78

###DELETING COLUMN

In [ ]:
#only gives copy not actual column in data frame will deleted
#for deleting row we use axis = 0 ; bydefault it delete row wise
DF2.drop("Percentage",axis=1)

    Name  Age  Class       State
0    Raj   18     12   Rajasthan
1  Ashok   17     11      Gujrat
2  Vijay   19     12   Rajasthan
3  Rahul   18     11  Tamil nadu

In [ ]:
#data frame remain the same
DF2

    Name  Age  Class       State  Percentage
0    Raj   18     12   Rajasthan          88
1  Ashok   17     11      Gujrat          89
2  Vijay   19     12   Rajasthan          98
3  Rahul   18     11  Tamil nadu          78

In [ ]:
#we use inplace for delete actual column in data frame
DF2.drop("Percentage",axis=1,inplace=True)

In [ ]:
#Percentage column is permanently deleted
DF2

    Name  Age  Class       State
0    Raj   18     12   Rajasthan
1  Ashok   17     11      Gujrat
2  Vijay   19     12   Rajasthan
3  Rahul   18     11  Tamil nadu

### SELECTING ROWS

In [ ]:
#we use loc for selecting rows
DF1.loc[0]

name           Raj
age             19
class           12
state    Rajasthan
Name: 0, dtype: object

SELECTING SUB-STRING OF ROWS AND COLUMNS

In [9]:
DF1.loc[[0,1]][['Name','Class']]

    Name  Class
0    Raj     12
1  Ashok     11

CONDITIONAL SELECTION

In [ ]:
#select who study in 11 class
DF2[DF2['Class'] == 11]

    Name  Age  Class       State
1  Ashok   17     11      Gujrat
3  Rahul   18     11  Tamil nadu

In [17]:
#select student who has age more than 18 and from rajasthan
DF1[(DF1['Age']>=18) & (DF1['State']=='Rajasthan')]

    Name  Age  Class      State
0    Raj   19     12  Rajasthan
2  Vijay   21     12  Rajasthan